; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 5358)
	(= (fuel plane1) 986)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 7)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city1)
	(= (capacity plane2) 10438)
	(= (fuel plane2) 3099)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 15)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city0)
	(= (capacity plane3) 5018)
	(= (fuel plane3) 951)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 6)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 1)
	(at plane4 city0)
	(= (capacity plane4) 4919)
	(= (fuel plane4) 916)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 5)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 3)
	(at person1 city2)
	(at person2 city1)
	(at person3 city1)
	(at person4 city2)
	(at person5 city1)
	(at person6 city0)
	(at person7 city0)
	(at person8 city2)
	(at person9 city1)
	(at person10 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 526)
	(= (distance city0 city2) 556)
	(= (distance city1 city0) 526)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 714)
	(= (distance city2 city0) 556)
	(= (distance city2 city1) 714)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at plane2 city0)
	(at plane3 city0)
	(at person1 city1)
	(at person2 city0)
	(at person3 city0)
	(at person4 city1)
	(at person5 city2)
	(at person6 city1)
	(at person7 city1)
	(at person8 city2)
	(at person9 city0)
	(at person10 city0)
	))

(:metric minimize (+ (* 1 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person2 plane2 city1)
   deleted: (at person2 city1)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 13
2. (board person3 plane2 city1)
   deleted: (at person3 city1)
   added: (in person3 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 13
3. (board person9 plane2 city1)
   deleted: (at person9 city1)
   added: (in person9 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 2 of 13
4. (board person5 plane2 city1)
   deleted: (at person5 city1)
   added: (in person5 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 2 of 13
5. (refuel plane1 city1)
   changed: (fuel plane1) from 986 to 5358
   goals met: 2 of 13
6. (zoom plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 0 to 3682, (fuel plane1) from 5358 to 1676
   goals met: 3 of 13
7. (board person6 plane1 city0)
   deleted: (at person6 city0)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 13
8. (board person7 plane1 city0)
   deleted: (at person7 city0)
   added: (in person7 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 13
9. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 3682 to 4734, (fuel plane1) from 1676 to 624
   goals met: 2 of 13
10. (debark person6 plane1 city1)
   deleted: (in person6 plane1)
   added: (at person6 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 3 of 13
11. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 13
12. (refuel plane1 city1)
   changed: (fuel plane1) from 624 to 5358
   goals met: 4 of 13
13. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4734 to 5786, (fuel plane1) from 5358 to 4306
   goals met: 5 of 13
14. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 5786 to 7890, (fuel plane2) from 3099 to 995
   goals met: 6 of 13
15. (debark person5 plane2 city0)
   deleted: (in person5 plane2)
   added: (at person5 city0)
   changed: (onboard plane2) from 4 to 3
   goals met: 6 of 13
16. (debark person2 plane2 city0)
   deleted: (in person2 plane2)
   added: (at person2 city0)
   changed: (onboard plane2) from 3 to 2
   goals met: 7 of 13
17. (debark person3 plane2 city0)
   deleted: (in person3 plane2)
   added: (at person3 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 8 of 13
18. (debark person9 plane2 city0)
   deleted: (in person9 plane2)
   added: (at person9 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 9 of 13
19. (board person5 plane1 city0)
   deleted: (at person5 city0)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 9 of 13
20. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 7890 to 9002, (fuel plane1) from 4306 to 3194
   goals met: 8 of 13
21. (debark person5 plane1 city2)
   deleted: (in person5 plane1)
   added: (at person5 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 13
22. (board person1 plane1 city2)
   deleted: (at person1 city2)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 9 of 13
23. (board person4 plane1 city2)
   deleted: (at person4 city2)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 9 of 13
24. (board person10 plane1 city2)
   deleted: (at person10 city2)
   added: (in person10 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 9 of 13
25. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 9002 to 10430, (fuel plane1) from 3194 to 1766
   goals met: 9 of 13
26. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 10 of 13
27. (debark person4 plane1 city1)
   deleted: (in person4 plane1)
   added: (at person4 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 11 of 13
28. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 10430 to 11482, (fuel plane1) from 1766 to 714
   goals met: 12 of 13
29. (debark person10 plane1 city0)
   deleted: (in person10 plane1)
   added: (at person10 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 13 of 13
